In [1]:
# Importing modules
import numpy as np
import pandas as pd

In [2]:
# Q1
#Write a Pandas program to convert Series of lists to one Series.

In [3]:
arr1=[2,3,43,46,99]
Ser=pd.Series(arr1)

In [4]:
type(Ser) # List changed to Series

pandas.core.series.Series

In [5]:
arr2=[[1,2,33],[88,67,54,99]]
Ser1=pd.Series(arr2)

In [6]:
type(Ser1) #Series of lists changed to Series type

pandas.core.series.Series

In [7]:
Ser1

0          [1, 2, 33]
1    [88, 67, 54, 99]
dtype: object

In [8]:
# Q2 
#Write a Pandas program to create a subset of a given series based on value and condition.

In [9]:
df = pd.Series([109, 720, 9630, 440, 250])
subset = df[df>=440]
subset2=df[df<=630]
print(subset)
print(subset2)

1     720
2    9630
3     440
dtype: int64
0    109
3    440
4    250
dtype: int64

In [10]:
#Q3
#Write a Pandas program to display most frequent value in a given series and replace everything else as Other in the series.

In [11]:
data = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4]
series = pd.Series(data)

series.value_counts()

series[~series.isin(series.value_counts() .index[:1])] = 'Other'
print("Series after replacing other values with 'Other':")
print(series)

Series after replacing other values with 'Other':
0    Other
1    Other
2    Other
3    Other
4    Other
5    Other
6        4
7        4
8        4
9        4
dtype: object

In [ ]:
#Q4 Write a Pandas program to find the positions of numbers that are multiples of 5 of a given series.

In [ ]:
a=[x*5 for x in range(1,11)]
a=pd.Series(a)
pos = a[a % 5 == 0].index
print(pos)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [ ]:
#Q5 Write a Pandas program to calculate the number of characters in each word in a given series.

In [ ]:
carr=['saikumar','rishabh','venkatesh']
carr=pd.Series(carr)

In [ ]:
word_lengths = carr.apply(lambda i: len(i))
print(word_lengths)

0    8
1    7
2    9
dtype: int64

In [ ]:
#Q7 Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [ ]:
data = {
    'Name': ['sai', 'rishabh', 'krishna', 'sharma'],
    'Age': [25, 30, 22, 28],
    'City': ['Guntur', 'Gurgoan', 'Delhi', 'Mumbai']
}

In [ ]:
ilabels = ['Person1', 'Person2', 'Person3', 'Person4']
df11 = pd.DataFrame(data, index=ilabels)

In [ ]:
df11

            Name  Age     City
Person1      sai   25   Guntur
Person2  rishabh   30  Gurgoan
Person3  krishna   22    Delhi
Person4   sharma   28   Mumbai

In [ ]:
#Q8 Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.
att={
    'Name':['sai','venkatesh','Munna'],
    'attempts':[2,5,4]
}
att1=pd.DataFrame(att)

In [ ]:
att1[att1['attempts']>2]

        Name  attempts
1  venkatesh         5
2      Munna         4

In [ ]:
#Q9 Write a Pandas program to append a new row 'k' to data frame with given values for each column. 
#Now delete the new row and return the original DataFrame.

In [ ]:
dff={
    'Name':['sai','koushik','Akshat'],
    'section':['o','e','c']
}
index_labels = ['Student1', 'Student2','Student3']
dff=pd.DataFrame(dff,index=index_labels)

In [ ]:
dff

             Name section
Student1      sai       o
Student2  koushik       e
Student3   Akshat       c

In [ ]:
dff2 = {
  "Name": ['anil','sanjay'],
  "section": ['f', 'j']
}
dff3=pd.DataFrame(dff2,index=['Student4','Student5'])

In [ ]:
dff1=dff.concat(dff3)
dff1

C:\Users\91868\AppData\Local\Temp\ipykernel_18136\1495316004.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dff1=dff.append(dff3)

             Name section
Student1      sai       o
Student2  koushik       e
Student3   Akshat       c
Student4     anil       f
Student5   sanjay       j

In [ ]:
dff1=dff1.drop('Student4')

In [ ]:
dff1.drop('Student5')

             Name section
Student1      sai       o
Student2  koushik       e
Student3   Akshat       c

In [ ]:
#Q10 Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [ ]:
arrr={
    'name':['lakshay','Harshith','Shubam'],
    'score': [23,22,24]
}
df112=pd.DataFrame(arrr)

In [ ]:
newdf = df112.sort_values(by='score',ascending=True)
newdf

       name  score
1  Harshith     22
0   lakshay     23
2    Shubam     24

In [ ]:
newdf2=df112.sort_values(by='name',ascending=False)
newdf2

       name  score
0   lakshay     23
2    Shubam     24
1  Harshith     22

In [ ]:
#Q11 Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no'with True and False.

In [ ]:
nd={
    'candidate':['bob','Alice','stephen'],
    'qualify':['Yes','No','No']
}
nnd=pd.DataFrame(nd)

In [ ]:
nnd=nnd.replace('Yes',True)
nnd=nnd.replace('No',False)

In [ ]:
nnd

  candidate  qualify
0       bob     True
1     Alice    False
2   stephen    False

In [ ]:
#Q12 Write a Pandas program to remove infinite values from a given DataFrame.

In [ ]:
data = {'C1': [1, 2, 3, np.inf, 5],
        'C2': [np.inf, 2, 3, 4, 5],
        'C3': [1, 2, 3, 4, 5]}
dffff = pd.DataFrame(data)
dffff.replace([np.inf, -np.inf], np.nan, inplace=True)
dffff.dropna(inplace=True)
print("DataFrame after removing infinite values:")
print(dffff)

DataFrame after removing infinite values:
    C1   C2  C3
1  2.0  2.0   2
2  3.0  3.0   3
4  5.0  5.0   5

In [ ]:
#Q6 Write a Pandas program to convert year-month string to dates adding a specified day of the month.

In [ ]:
dataf = {'YearMonth': ['2003-11', '2003-08', '2004-12', '2004-04']}
df = pd.DataFrame(dataf)
specified_day = 15
df['Date'] = pd.to_datetime(df['YearMonth'] + '-' + str(specified_day), format='%Y-%m-%d')
print("DataFrame after converting year-month string to dates:")
print(df)

DataFrame after converting year-month string to dates:
  YearMonth       Date
0   2003-11 2003-11-15
1   2003-08 2003-08-15
2   2004-12 2004-12-15
3   2004-04 2004-04-15